{
  "scaleParams": {
    "offset": "offset",
    "center": "center",
    "context": "context",
    "tonal": "tonal",
    "modal": "modal",
    "degrees": "degrees",
    "hide": "hide"
  },
  "tooltips": {
    "tooltip": "Click on a black note",
    "hide": "Click to remove a degree from the scale. This lets you keep only chord tones: 1, 3, 5",
    "tonal": "Changes the tonic of the scale. Degrees and chords are built from it",
    "modal": "Shifting the interval pattern changes the mode. Moving 5 steps right gives the Aeolian mode (natural minor)",
    "degrees": "Shifts the center within the scale. The mode changes without altering the notes, unlike modal shift",
    "center": "The center is the root note of the scale. It is always the first degree and the reference point for chords, regardless of context",
    "context": "Context builds the scale from a related key around the center. For example, F gives B♭ for C7",
    "fretboard": "The first string is the thinnest. Click on the open fret to configure that string. This allows custom tuning."
  },
  "fretboard": {
    "openNoteLabel": "Open note",
    "octaveLabel": "Octave",
    "confirmButton": "✓",
    "octaveName0": "subcontra",
    "octaveName1": "contra",
    "octaveName2": "great",
    "octaveName3": "small",
    "octaveName4": "one-lined",
    "octaveName5": "two-lined",
    "octaveName6": "three-lined",
    "octaveName7": "four-lined",
    "octaveName8": "five-lined"
  },
  "content": {
    "pageTitle": "Scales and Chords Online",
    "pageDescription": "An interactive music theory calculator for building scales, chords, and interval patterns.",
    "sectionTheoryTitle": "Music Theory — Visually",
    "sectionTheoryText": "This tool helps you learn music theory through visualization. Choose a tonic, build an interval pattern, and see how scales and chords look on different instruments.",
    "sectionFeaturesTitle": "What You Can Build",
    "featureScales": "Scales and modes",
    "featureChords": "Chords and intervals",
    "featureIntervals": "Interval patterns (whole / half step)",
    "featureDegrees": "Scale degrees and structures",
    "sectionAudienceTitle": "Who This Is For",
    "sectionAudienceText": "This tool is designed for beginner musicians and anyone studying the basics of music theory, regardless of their instrument.",
    "sectionInstrumentsTitle": "Instrument Support",
    "sectionInstrumentsText": "Visualization is available for keyboard and string instruments. In the future, string instruments will support configuring the number of strings for bass, ukulele, and other instruments.",
    "footerText": "Interactive Music Theory • Scales • Chords • Intervals",
    "aboutTooltip": "— a red note is a tooltip with useful information. Works on hover and touch on mobile.",
    "fretboardInfo": "Different note colors on the guitar fretboard indicate the octave. You can adjust the tuning of each string."
  },
  "errors": {
    "resolveError": "Center {note} is not in the {targets} scale"
  }
}
